sampleresults/aws-ec2-xfs/gp3-write-test.txt
rand-write-bs1m: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
rand-write-bs4k: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.27
Starting 2 processes
rand-write-bs1m: Laying out IO file (1 file / 1024MiB)
rand-write-bs4k: Laying out IO file (1 file / 1024MiB)
Jobs: 1 (f=1): [_(1),F(1)][100.0%][eta 00m:00s]
rand-write-bs1m: (groupid=0, jobs=1): err= 0: pid=3934: Sun Feb 26 10:43:25 2023
  write: IOPS=125, BW=125MiB/s (131MB/s)(8193MiB/65361msec); 0 zone resets
    slat (usec): min=339, max=23262, avg=2181.20, stdev=4367.40
    clat (nsec): min=873, max=265905, avg=2291.07, stdev=4028.74
     lat (usec): min=340, max=23271, avg=2184.51, stdev=4369.49
    clat percentiles (nsec):
     |  1.00th=[   932],  5.00th=[   980], 10.00th=[  1012], 20.00th=[  1064],
     | 30.00th=[  1208], 40.00th=[  1480], 50.00th=[  1736], 60.00th=[  2008],
     | 70.00th=[  2192], 80.00th=[  2416], 90.00th=[  4960], 95.00th=[  5600],
     | 99.00th=[  6432], 99.50th=[  7648], 99.90th=[ 48384], 99.95th=[ 62720],
     | 99.99th=[264192]
   bw (  KiB/s): min=12288, max=1551390, per=100.00%, avg=381679.66, stdev=478472.74, samples=44
   iops        : min=   12, max= 1515, avg=372.59, stdev=467.13, samples=44
  lat (nsec)   : 1000=7.56%
  lat (usec)   : 2=52.26%, 4=26.57%, 10=13.22%, 20=0.12%, 50=0.17%
  lat (usec)   : 100=0.09%, 500=0.01%
  cpu          : usr=0.24%, sys=6.52%, ctx=10586, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
rand-write-bs4k: (groupid=1, jobs=1): err= 0: pid=3935: Sun Feb 26 10:43:25 2023
  write: IOPS=27.8k, BW=109MiB/s (114MB/s)(7925MiB/72937msec); 0 zone resets
    slat (usec): min=2, max=19358, avg= 7.31, stdev=208.95
    clat (nsec): min=616, max=5064.8k, avg=729.12, stdev=7534.07
     lat (usec): min=2, max=19365, avg= 8.12, stdev=209.17
    clat percentiles (nsec):
     |  1.00th=[  628],  5.00th=[  628], 10.00th=[  636], 20.00th=[  636],
     | 30.00th=[  644], 40.00th=[  652], 50.00th=[  652], 60.00th=[  660],
     | 70.00th=[  660], 80.00th=[  668], 90.00th=[  748], 95.00th=[  820],
     | 99.00th=[ 1080], 99.50th=[ 1544], 99.90th=[12352], 99.95th=[18560],
     | 99.99th=[82432]
   bw (  KiB/s): min= 3832, max=984592, per=100.00%, avg=396108.54, stdev=311912.24, samples=41
   iops        : min=  958, max=246148, avg=99027.00, stdev=77978.07, samples=41
  lat (nsec)   : 750=90.02%, 1000=8.66%
  lat (usec)   : 2=1.08%, 4=0.06%, 10=0.05%, 20=0.10%, 50=0.02%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%
  cpu          : usr=3.71%, sys=10.28%, ctx=65877, majf=0, minf=58
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2028803,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=125MiB/s (131MB/s), 125MiB/s-125MiB/s (131MB/s-131MB/s), io=8193MiB (8591MB), run=65361-65361msec

Run status group 1 (all jobs):
  WRITE: bw=109MiB/s (114MB/s), 109MiB/s-109MiB/s (114MB/s-114MB/s), io=7925MiB (8310MB), run=72937-72937msec

Disk stats (read/write):
  nvme0n1: ios=10/307036, merge=0/85, ticks=39/1210943, in_queue=1210982, util=95.56%